Revit 2027 API
ParameterMap.ReverseIterator Method
Retrieve a backward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ParameterMapIterator ReverseIterator()
Public Overridable Function ReverseIterator As ParameterMapIterator
public:
virtual ParameterMapIterator^ ReverseIterator()
abstract ReverseIterator : unit -> ParameterMapIterator
override ReverseIterator : unit -> ParameterMapIterator
Return Value
ParameterMapIterator
Returns a backward moving iterator to the map.
See Also
Reference
ParameterMap Class
Autodesk.Revit.DB Namespace